# Formas de Seleção

In [59]:
import pandas as pd

In [60]:
# Método .split() tira os espaços e retorna uma lista com os elementos organizados por aspas.
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [61]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [62]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [63]:
# Selecionar a coluna c1: 
df.c1

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [64]:
# Outra maneira de selecionar a coluna c1:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [65]:
# Ambas retornam uma Series.
type(df.c1)

pandas.core.series.Series

In [66]:
# Selecionando mais de uma coluna coloca dois colchetes [[]]: Retorna um DatFrame
df[['c1', 'c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [67]:
# Selecionando as linhas:
# 1° -> todas as linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [68]:
# Selecionando a partir da segunda linha:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [69]:
# Selecionando a partir da terceira linha:
df[:2]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [70]:
# Selecionando somente as linhas l2 e l3:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [71]:
# Selecionando a partir da linha l1 e as colunas c3 e c1:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [72]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [73]:
# Usando o método loc[] com o método loc nos podemos selecionar pelo rotudo da linha: ele retorna uma Series da linha:
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [74]:
df.loc['l1']

c1    1
c2    2
c3    3
c4    4
Name: l1, dtype: int64

In [75]:
# Selecionando mais de uma linha com o método loc:
df.loc[['l1', 'l4']]

    c1  c2  c3  c4
l1   1   2   3   4
l4  13  14  15  16

In [76]:
# Selecionando linh 1 l1 e a coluna 2 c2:
df.loc['l1', 'c2']

2

In [77]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [78]:
# Selecionando linha 2 com iloc: a Diferença do loc que usa os rotulos é que o iloc usa o indice:
df.iloc[2]

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [79]:
df.iloc[0]

c1    1
c2    2
c3    3
c4    4
Name: l1, dtype: int64

In [80]:
# Selecionando pela linha e pela coluna: [index da linha, index da coluna]
df.iloc[3,2]

15

In [81]:
# Selecionando um grupo de linhas e um grupo de colunas:
df.loc[['l1', 'l4'], ['c4', 'c1']]

    c4  c1
l1   4   1
l4  16  13

In [82]:
# Selecionando o mesmo grupo de linhas e um grupo de colunas com iloc:

df.iloc[[0, 3],[3,0]]

    c4  c1
l1   4   1
l4  16  13

In [83]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [84]:
# Atribuindo um valor na linha l4 e coluna c4: mudando de 16 para 18
df.loc['l4', 'c4'] = 18

In [85]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  18